Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_176-Vimalakirtinirdesa-v1.tmx
Source language: bo
Languages: en

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྫུ་འཕྲུལ་ཐོབ་པ་ཐམས་ཅད་ཀྱིས་བསྐལ་པ་བྱེ་བ་བརྒྱ་སྟོང་དུའང་རྫུ་འཕྲུལ་དང་རྣམ་པར་སྤྲུལ་པའི་ཆོ་འཕྲུལ་ཐམས་ཅད་ཀྱིས་སྟོན་མི་ནུས་སོ།
en: could not be performed by the disciples and solitary sages who have attained miraculous powers, were they to devote all their powers of incarnation and transformation during one hundred thousand millions of eons.

source: བཅོམ་ལྡན་འདས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཡུལ་དང་། ཐབས་མཁས་པ་ནི་བསམ་གྱིས་མི་ཁྱབ་སྟེ།
en: Lord, the realms of the buddhas and their skill in liberative art are inconceivable.

source: །ཉོན་མོངས་པ་རྒྱས་པ་རྣམས་ལ་ཚུལ་བཞིན་ཉེ་བར་སྦྱོར་བའོ།
en: making reasonable those whose passions are excessive;

source: །དབེན་པ་ལ་དགའ་ཞིང་དེ་ལ་མ་ཆགས་པའོ།
en: taking pleasure in solitude, without being attached to it;

source: །མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཡོངས་སུ་བསྐང་བའི་ཕྱིར་གཏན་པ་མེད་པའི་མཆོད་སྦྱིན་ཡོངས་སུ་གཏོང་བའོ།
en: offering limitless pure sacrifices to fulfill the auspicious marks and signs; adorning body, speech, and mind by refraining from all sins;

source: །སྡིག་པ་ཐམས་ཅད་མི་བྱེད་པས་ལུས་དང་། ངག་དང་། སེམས་བརྒྱན་པའོ། །ལུས་དང་ངག་ཡོངས་སུ་དག་ཅིང་སེམས་ཡོངས་སུ་དག་པས་བསྐལ་པ་གྲངས་མེད་པར་འཁོར་བའོ།
en: continuing in reincarnations during immeasurable eons, while purifying body, speech, and mind;

source: །སེམས་དཔའ་བས་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་ཚད་མེད་པ་ཐོས་ཀྱང་ཞུམ་པར་མི་འགྱུར་བའོ།
en: avoiding discouragement, through spiritual heroism, when learning of the immeasurable virtues of the Buddha;

source: །ཉོན་མོངས་པའི་དགྲ་ཚར་གཅད་པར་བྱ་བའི་ཕྱིར།
en: to chastise the enemy afflictions;

source: ཤེས་རབ་ཀྱི་མཚོན་རྣོན་པོ་ཐོགས་པའོ།
en: wielding the sharp sword of wisdom

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཁུར་བཀུར་བའི་ཕྱིར་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ཀུན་ཤེས་པའོ།
en: knowing well the aggregates, the elements, and the sense-media in order to bear the burdens of all living beings;

source: ། འཇིག་རྟེན་ཐམས་ཅད་དགའ་བར་བྱ་བའི་ཕྱིར། འཇིག་རྟེན་གྱི་ཆོས་ཐམས་ཅད་དང་མ་འདྲེས་པའོ།
en: not mixing with worldly things in order to delight all the people;

source: །འཇིག་རྟེན་དང་འཐུན་པར་བྱ་བའི་ཕྱིར་སྤྱོད་ལམ་ཐམས་ཅད་ལས་མ་ཉམས་པའོ།
en: being faultless in all activities in order to conform to all people;

source: །བྱ་བ་ཐམས་ཅད་ཡང་དག་པར་བསྟན་པར་བྱ་བའི་ཕྱིར། མངོན་པར་ཤེས་པ་བསྐྱེད་པའོ།
en: producing the superknowledges to actually accomplish all duties of benefit to living beings;

source: །ཐོས་པ་ཐམས་ཅད་གཟུང་བའི་ཕྱིར།
en: in order to retain all learning;

source: གཟུངས་དང་། དྲན་པ་དང་། ཡེ་ཤེས་སོ།
en: acquiring incantations, memory, and knowledge

source: བདག་མེད་པར་སོ་སོར་རྟོག་ཀྱང་སེམས་ཅན་ལ་སྙིང་རྗེ་ཆེན་པོ་མི་འདོར།
en: He considers selflessness, yet does not abandon the great compassion toward all living beings.

source: རྒྱུ་བ་མེད་པར་སོ་སོར་རྟོག་ཀྱང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་རྒྱུ་བར་ཡང་འགྱུར་
en: He considers motionlessness, yet he moves in order to develop all living beings.

source: གསོག་དང་། གསོབ་དང་། སྙིང་པོ་མེད་པ་དང་། བདག་པོ་མེད་པ་དང་། གནས་མེད་པར་སོ་སོར་རྟོག་ཀྱང་
en: He considers vanity, futility, insubstantiality, dependency, and placelessness, yet

source: བསོད་ནམས་གསོག་མ་ཡིན་པ་དང་། ཡེ་ཤེས་གསོབ་མ་ཡིན་པ་དང་། བརྣགས་པ་ཡོངས་སུ་རྫོགས་ཤིང་རང་བྱུང་བའི་ཡེ་ཤེས་སུ་དབང་བསྐུར་བ་དང་། རང་བྱུང་གི་ཡེ་ཤེས་ལ་བརྩོན་པ་དང་། ངེས་པའི་དོན་སངས་རྒྱས་ཀྱི་རིགས་ལ་རབ་ཏུ་གནས་པ་ཡིན་ཏེ།
en: he establishes himself on merits that are not vain, on knowledge that is not futile, on reflections that are substantial, on the striving for the consecration of the independent gnosis, and on the buddha lineage in its definitive meaning.

source: བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱ་བ་དང་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མཆོད་པར་བྱ་བའི་ཕྱིར་
en: In order to worship the Buddha Śākyamuni and the bodhisattvas of the Sahā universe, as well as this teaching,

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཐམས་ཅད་ཕྱེ་མ་དང་། སྤོས་དང་། བདུག་པ་མང་པོ་ཐམས་ཅད་དང་མེ་ཏོག་གིས་པུས་མོ་ནུབ་ཙམ་དུ་ཁེབས་པར་བྱས་ཏེ།
en: they covered the whole earth of this billion-world galactic universe with fragrant powder, incense, perfumes, and flowers up to the height of the knees.

source: བཅོམ་ལྡན་འདས་ལ་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Thus addressed, the Licchavi Vimalakīrti said to the Buddha,

source: གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་ཀྱི་རང་བཞིན་ཏེ།
en: He is the essence that is the reality of matter,

source: ཆོས་ཐམས་ཅད་ལ་མ་ཆགས་པའི་མཐར་ཕྱིན་པ།
en: The Tathāgata has reached the extreme of detachment in regard to all things,

source: ཡང་དག་པ་ཉིད་ཀྱི་མཐའ་མ་མཆིས་པ།
en: yet he is not a reality-limit.

source: དེ་བཞིན་ཉིད་ལ་རབ་ཏུ་གནས་པ་དེ་ཕན་ཚུན་དུ་བྲལ་བ།
en: He abides in ultimate reality, yet there is no relationship between it and him.

source: འདི་ན་ཡང་མ་ལགས་པ། ཕ་བིན་ཡང་མ་ལགས་པ།
en: He is neither here, nor there, nor anywhere else.

source: དེ་ན་ཡང་མ་ལགས་པ། གཞན་ན་ཡང་མ་ལགས་པ།
en: He is neither this nor that.

source: མཚན་མ་མ་མཆིས་པ། འདུས་མ་བགྱིས་པ།
en: He is not a whole, nor a conglomeration.

source: ཆོས་ཉིད་ཀྱིས་མཚུངས་པ།
en: yet equal to the ultimate reality of things.

source: མཚུངས་པ་མ་མཆིས་པ། བརྩོན་འགྲུས་མཚུངས་པ་མ་མཆིས་པ།
en: He is matchless, especially in effort.

source: མཐོང་བ་དང་ཐོས་པ་དང་། བྱེ་བྲག་ཕྱེད་པ་དང་། རྣམ་པར་རིག་པའང་མ་ལགས་པ།
en: He is not seen, heard, distinguished, or known.

source: མདུད་པ་ཐམས་ཅད་མ་མཆིས་པ།
en: He is without any complexity,

source: མི་རྟོག་པ། རྣམ་པར་མི་རྟོག་པ།
en: without conception, and without intellectualization.

source: མ་བགྱིས་པ། མ་སྐྱེས་པ།
en: He is without activity, without birth,

source: མ་འཐོན་པ། མ་བྱུང་བ། ཀུན་ནས་མ་བྱུང་བ།
en: without occurrence, without origin,

source: འབྱུང་བར་འགྱུར་བ་ཡང་མ་ལགས་པ། འབྱུང་བར་མི་འགྱུར་བའང་མ་ལགས་པ།
en: without production, and without nonproduction.

source: གནས་བརྟན་གྱིས་ཆོས་གང་མངོན་དུ་བྱས་པའི་ཆོས་དེ་ལ་འཆི་འཕོ་དང་། སྐྱེ་བ་གང་ཡང་ཡོད་དམ།
en: Is there anything among the things that you see, elder, that dies or is reborn?

source: ཆོས་དེ་ལ་འཆི་འཕོའམ་སྐྱེ་བ་གང་ཡང་མེད་དོ།
en: There is nothing that dies or is reborn.

source: བཙུན་པ་ཤཱ་རིའི་བུ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་འཆི་འཕོ་མེད་ཅིང་སྐྱེ་བ་མེད་ན་ཅིའི་ཕྱིར་ན་དེ་ལྟ་བུར་ཁྱོད་གང་ནས་ཤི་འཕོས་ཤིང་འདིར་སྐྱེས་སྙམ་དུ་སེམས།
en: Likewise, reverend Śāriputra, as all things neither die nor are reborn, why do you ask, “Where did you die to reincarnate here?”

source: རིགས་ཀྱི་བུ་སྤྲུལ་པ་ལ་འཆི་འཕོ་ཡང་མེད། སྐྱེ་བའང་མེད་ན་དེ་ཅི་ཞིག་ལན་ལྡོན།
en: Noble sir, a magical creation does not die, nor is it reborn.

source: བཙུན་པ་ཤཱ་རིའི་བུ་ཆོས་ཐམས་ཅད་ནི་སྤྲུལ་པའི་རང་བཞིན་ནོ་ཞེས་དེ་བཞིན་གཤེགས་པས་མ་གསུངས་སམ།
en: Reverend Śāriputra, did not the Tathāgata declare that all things have the nature of a magical creation?

source: རིགས་ཀྱི་བུ་དེ་དེ་བཞིན་ནོ།
en: Yes, noble sir, that is indeed so.

source: བཙུན་པ་ཤཱ་རིའི་བུ་ཆོས་ཐམས་ཅད་སྤྲུལ་པའི་རང་བཞིན་ལྟ་བུ་ལ་ཅིའི་ཕྱིར་ཁྱོད་འདི་སྙམ་དུ་ཁྱོད་ག་ལས་ཤི་འཕོས་ཏེ་འདིར་སྐྱེས་སྙམ་དུ་སེམས།
en: Reverend Śāriputra, since all things have the nature of a magical creation, why do you ask, “Where have you died to reincarnate here?”

source: བཅོམ་ལྡན་འདས་སྐྱེས་བུ་དམ་པ་འདི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ཙམ་དུ་རྣམ་པར་དག་པ་ནས་མཆིས་ཏེ། སངས་རྒྱས་ཀྱི་ཞིང་ནོངས་པ་མང་པོའི་སྐྱོན་ཆགས་པ་ལ་མངོན་པར་དགའ་བ་ནི་ངོ་མཚར་ཏོ།
en: Lord, it is wonderful that this holy person, having left a buddhafield as pure as Abhirati, should enjoy a buddhafield as full of defects as this Sahā universe!

source: ཉི་མའི་འོད་རྣམས་མུན་པ་དང་ལྷན་ཅིག་འགྲོགས་སམ།
en: Does the light of the sun accompany the darkness?

source: དེ་ནི་མ་ཡིན་ནོ།
en: Certainly not,

source: དེ་གཉིས་མི་འགྲོགས་སམ།
en: Then the two do not go together?

source: ཅིའི་ཕྱིར་ན་འཛམ་བུའི་གླིང་དུ་ཉི་མ་འཆར།
en: Then why does the sun rise over the world?

source: དེ་ནི་སྣང་བར་བྱ་བ་དང་མུན་པ་བསལ་བའི་ཕྱིར་རོ།
en: It rises to illuminate the world, and to eliminate the darkness.

source: བཙུན་པ་ཤཱ་རིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ནི་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྦྱང་བ་དང་། ཡེ་ཤེས་ཀྱི་སྣང་བར་བྱ་བ་དང་། མུན་པ་ཆེན་པོ་བསལ་བའི་ཕྱིར་བསམས་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་མ་དག་པ་རྣམས་སུ་སྐྱེ་སྟེ།
en: Just in the same way, reverend Śāriputra, the bodhisattva reincarnates voluntarily in the impure buddhafields in order to purify the living beings, in order to make the light of wisdom shine, and in order to clear away the darkness.

source: །དེ་ནས་འཁོར་དེ་དག་ཐམས་ཅད་འཇིག་རྟེན་གྱི་ཁམས་མངོན་པར་དགའ་བ་དེ་དང་། དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པ་དེ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། ཉན་ཐོས་ཆེན་པོ་དེ་དག་བདག་ཅག་གིས་བལྟའོ་སྙམ་དུ་སྐོམ་པར་གྱུར་ཏོ།
en: Thereupon, the entire multitude experienced the desire to behold the universe Abhirati, the Tathāgata Akṣobhya, his bodhisattvas, and his great disciples.

source: བདག་སེང་གེའི་ཁྲི་འདི་ལས་མ་ལངས་པར་
en: Without rising from my couch,

source: འཇིག་རྟེན་གྱི་ཁམས་མངོན་པར་དགའ་བ་དེ་དང་།
en: the universe Abhirati and

source: ཟླ་བ་དང་། ཉི་མ་དང་། སྐར་མར་བཅས་པ་དང་།
en: its moon, its sun, and its stars;

source: ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་།
en: its devas, nāgas, yakṣas,

source: གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་། མིར་བཅས་པ། བུད་མེད་དང་། ཁྱིམ་དུ་བཅས་པ་དང་།
en: its villages, cities, towns, provinces, kingdoms, men, women, and houses;

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་འཁོར་དེ་དག་ཐམས་ཅད་ལ་བཀའ་སྩལ་པ།
en: Thereupon, the Buddha Śākyamuni asked all the multitudes,

source: ཀྱེ་གྲོགས་པོ་དག་འཇིག་རྟེན་གྱི་ཁམས་མངོན་པར་དགའ་བ་དང་། དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་བཀོད་པ་དང་། ཉན་ཐོས་བཀོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་བཀོད་པ་འདི་དག་ལ་ལྟོས་ཤིག
en: Friends, behold the splendors of the universe Abhirati, the Tathāgata Akṣobhya, the array of his buddhafield, and the splendors of these disciples and bodhisattvas!

source: །དེ་དག་གིས་གསོལ་པ།
en: They replied,

source: སངས་རྒྱས་ཀྱི་ཞིང་འདི་འདྲ་བ་ཡོངས་སུ་གཟུང་བར་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔས་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་བསླབ་པར་བྱའོ།
en: Those bodhisattvas who wish to embrace such a buddhafield should educate themselves in all the bodhisattva-practices of the Tathāgata Akṣobhya.

source: །དེ་ལྟར་འཇིག་རྟེན་གྱི་ཁམས་མངོན་པར་དགའ་བ་བསྟན་པའི་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་དང་། དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པ་བསྟན་པས་
en: with his miraculous power, showed them thus the universe Abhirati and the Tathāgata Akṣobhya,

source: འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིའི་ལྷ་དང་མིའི་སྐྱེ་དགུ་ལས་ཁྲི་ཕྲག་བཅུ་བཞི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེས་སོ།
en: one hundred and forty thousand living beings among the men and gods of the Sahā universe conceived the spirit of unexcelled, perfect enlightenment,

source: །ཀུན་གྱིས་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་མངོན་པར་དགའ་བ་དེར་སྐྱེ་བར་སྨོན་ལམ་བཏབ་སྟེ།
en: all of them formed a prayer to be reborn in the universe Abhirati,

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་དེ་དག་ཐམས་ཅད་འཇིག་རྟེན་གྱི་ཁམས་མངོན་པར་དགའ་བར་སྐྱེ་བར་ལུང་བསྟན་ཏོ།
en: and the Buddha prophesied that in the future all would be reborn in the universe Abhirati.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་སྨིན་པར་བྱས་ནས་
en: having thus developed all the living beings who could thereby be developed,

source: འཇིག་རྟེན་གྱི་ཁམས་མངོན་པར་དགའ་བ་དེ་སླར་གནས་ཇི་ལྟ་བ་བཞིན་དུ་བཞག་གོ།
en: returned the universe Abhirati exactly to its former place.

source: ། ཤཱ་རིའི་བུ་ཁྱོད་ཀྱིས་འཇིག་རྟེན་གྱི་ཁམས་མངོན་པར་དགའ་བ་དེ་དང་། དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པ་དེ་མཐོང་ངམ།
en: Śāriputra, did you see that universe Abhirati, and the Tathāgata Akṣobhya?

source: བཅོམ་ལྡན་འདས་བདག་གིས་མཐོང་ལགས་སོ།
en: I saw it, Lord!

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་དེ་འདྲ་བར་གྱུར་ཅིག
en: May all living beings come to live in a buddhafield as splendid as that!

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱང་རིགས་ཀྱི་བུ་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་ཇི་ལྟ་བུ་དེ་འདྲ་བའི་རྫུ་འཕྲུལ་དང་ལྡན་པར་གྱུར་ཅིག
en: May all living beings come to have miraculous powers just like those of the noble Licchavi Vimalakīrti!

source: །བདག་ཅག་ཀྱང་སྐྱེས་བུ་དམ་པ་འདི་ལྟ་བུ་མཐོང་བ་ཐོབ་པ་ནི་རྙེད་པ་ལེགས་པར་ལགས་ཏེ།
en: We have gained great benefit from having seen a holy man such as he.

source: གང་དག་ཐ་ན་ད་ལྟར་གྱི་དེ་བཞིན་གཤེགས་པའམ། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་པའི་སེམས་ཅན་དེ་དག་ཀྱང་རྙེད་པ་རབ་ཏུ་རྙེད་པར་འགྱུར་ན།
en: We have gained a great benefit from having heard such teaching of the Dharma, whether the Tathāgata himself still actually exists or whether he has already attained ultimate liberation.

source: གང་དག་ཐོས་ནས་མོས་པ་དང་། ཡིད་ཆེས་པ་དང་། འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། མོས་ནས་སྟོན་པ་དང་། རབ་ཏུ་འདོན་པ་དང་། གཞན་དག་ལའང་འཆད་པ་དང་། སྒོམ་པའི་རྣལ་འབྱོར་ལ་རྗེས་སུ་སྦྱོར་བ་རྣམས་ལ་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ།
en: Hence, there is no need to mention the great benefit for those who, having heard it, believe it, rely on it, embrace it, remember it, read it, and penetrate to its depth, and, having found faith in it, teach, recite, and show it to others and apply themselves to the yoga of meditation upon its teaching.

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གང་དག་གི་སུག་པར་ཐོབ་པར་གྱུར་པ་དེ་དག་ཀྱང་ཆོས་རིན་པོ་ཆེའི་གཏེར་རྙེད་པར་འགྱུར་རོ།
en: Those living beings who understand correctly this teaching of the Dharma will obtain the treasury of the jewels of the Dharma.

source: །གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཁ་ཏོན་དུ་བགྱིད་པ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པའི་གྲོགས་སུ་གྱུར་པ་ལགས་སོ།
en: Those who study correctly this teaching of the Dharma will become the companions of the Tathāgata.

source: །གང་དག་ཆོས་འདི་ལ་མོས་པ་རྣམས་ལ་རིམ་གྲོ་དང་བསྙེན་བཀུར་བགྱིད་པ་དེ་དག་ནི་ཆོས་ཡང་དག་པར་སྲུང་བ་ལགས་སོ།
en: Those who honor and serve the adepts of this doctrine will be the true protectors of the Dharma.

source: །གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལེགས་པར་བྲིས་ཏེ་འཆང་བ་དང་རི་མོར་བགྱིད་པ་དེ་དག་གི་ཁྱིམ་ན་དེ་བཞིན་གཤེགས་པ་བཞུགས་པར་འགྱུར་རོ།
en: Those who write, teach, and worship this teaching of the Dharma will be visited by the Tathāgata in their homes.

source: །གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་རྗེས་སུ་ཡི་རང་བ་དེ་དག་ནི་བསོད་ནམས་ཐམས་ཅད་ཡོངས་སུ་བཟུང་བ་ལགས་སོ།
en: Those who take pleasure in this teaching of the Dharma will embrace all merits.

source: །གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལས་ཐ་ན་ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་གཅིག་ཙམ་དང་། སྡོམ་པའི་ཚིག་ཙམ་ཡང་གཞན་དག་ལ་སྟོན་པ་དེ་དག་ནི་
en: Those who teach it to others, whether it be no more than a single stanza of four lines, or a single summary phrase from this teaching of the Dharma,

source: ཆོས་ཀྱི་མཆོད་སྦྱིན་ཆེན་པོ་བགྱིད་པ་ལགས་སོ།
en: will be performing the great Dharma-sacrifice.

source: ། གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་བཟོད་པ་དང་། འདུན་པ་དང་། བློ་གྲོས་དང་། རྟོག་པ་དང་། ལྟ་བ་དང་། མོས་པ་དག་ནི་
en: And those who devote to this teaching of the Dharma their tolerance, their zeal, their intelligence, their discernment, their vision, and their aspirations,

source: དེ་ཉིད་དེ་དག་ལ་ལུང་བསྟན་པ་ལགས་སོ།
en: thereby become subject to the prophesy of future Buddhahood!

source: །།དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then Śakra, the king of the gods, said to the Buddha,

source: །བཅོམ་ལྡན་འདས་བདག་གིས་སྔོན་དེ་བཞིན་གཤེགས་པ་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལས་ཆོས་ཀྱི་རྣམ་གྲངས་བརྒྱ་སྟོང་མང་པོ་ཐོས་ཀྱང་
en: Lord, formerly I have heard from the Tathāgata and from Mañjuśrī, the crown prince of wisdom, many hundreds of thousands of teachings of the Dharma, but

source: ཇི་ལྟར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལས་རྣམ་པར་སྤྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་ཚུལ་ལ་འཇུག་པ་རབ་ཏུ་བསྟན་པ་འདི་ལྟ་བུ་ནི་སྔོན་ནམ་ཡང་མ་ཐོས་ལགས་སོ།
en: I have never before heard a teaching of the Dharma as remarkable as this instruction in the entrance into the method of inconceivable transformations.

source: །བཅོམ་ལྡན་འདས་སེམས་ཅན་གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློ་ག་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པ་དེ་དག་ཀྱང་ཐེ་ཙོམ་མ་མཆིས་པར་འདི་ལྟ་བུའི་ཆོས་ཀྱི་སྣོད་དུ་འགྱུར་ན།
en: Lord, those living beings who, having heard this teaching of the Dharma, accept it, remember it, read it, and understand it deeply will be, without a doubt, true vessels of the Dharma;

source: །གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་གང་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྤྱོད་པ་དང་། འཆང་བ་དང་། རབ་ཏུ་སྟོན་པ་
en: To the villages, towns, cities, states, kingdoms, and capitals wherein this teaching of the Dharma will be applied, taught, and demonstrated,

source: དེར་ཆོས་ཉན་པའི་སླད་དུ་བདག་གཡོག་དང་བཅས་ཏེ་མཆིའོ།
en: I and my followers will come to hear the Dharma.

source: །ལྷའི་དབང་པོ་དེ་བས་ན་
en: Therefore, king of gods,

source: གང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་པ་དང་། ཐ་ན་གླེགས་བམ་ལ་འདྲི་བ་དང་། འཛིན་པ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་ནི་
en: when noble sons and daughters accept it, repeat it, understand it deeply, write it completely, and, making it into a book, honor it,

source: འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་མཆོད་པར་འགྱུར་རོ།
en: pay homage to the buddhas of the past, present, and future.

source: །ལྷའི་དབང་པོ་རིགས་ཀྱི་བུ་ཕོའམ། རིགས་ཀྱི་བུ་མོ་གང་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་དེ་བཞིན་གཤེགས་པས་ཡོངས་སུ་གང་བ་འདི་ལྟ་སྟེ་དཔེར་ན་བུ་རམ་ཤིང་གི་ཚལ་ལམ། འདམ་བུའི་ཚལ་ལམ། སྨྱིག་མའི་ཚལ་ལམ། ཏིལ་གྱི་ཞིང་ངམ། སེང་ལྡེང་གི་ཚལ་བཞིན་དུ་རབ་ཏུ་གང་བ་རྣམས་ལ་བསྐལ་པའམ། བསྐལ་པ་ལས་ལྷག་པར་རིམ་གྲོར་བྱས། བླ་མར་བྱས། བསྟི་སྟང་དུ་བྱས་ཏེ། དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་མཆོད་པ་ཐམས་ཅད་དང་བདེ་བའི་ཡོ་བྱད་ཀྱིས་མཆོད་པ་དང་།
en: Let us suppose, king of gods, that this billion-world galactic universe were as full of tathāgatas as it is covered with groves of sugarcane, with rosebushes, with bamboo thickets, with sesame gardens, and with flowers, and that a noble son or daughter were to honor them, revere them, respect and adore them, offering them all sorts of comforts and offerings for an eon or more than an eon.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་
en: And let us suppose that, these tathāgatas having entered ultimate liberation,

source: དེ་བཞིན་གཤེགས་པ་རེ་རེ་ལ་ཡང་མཆོད་པའི་ཕྱིར་གཅིག་ཏུ་མཁྲེགས་པ་མ་ཞིག་པའི་སྐུ་གདུང་གི་མཆོད་རྟེན་རིན་པོ་ཆེ་ཐམས་ཅད་ལས་བྱས་པ་རྒྱར་ནི་གླིང་ཆེན་པོ་བཞི་པའི་འཇིག་རྟེན་གྱི་ཚད་ཙམ།
en: he or she honored each of them by enshrining their preserved bodies in a memorial stūpa made of precious stones, each as large as a world with four great continents,

source: ལྷའི་དབང་པོ་ཁྱོད་མོས་པར་བྱའོ། །ཁྱོད་ཀྱིས་ཁོང་དུ་ཆུད་པར་བྱའོ།
en: Have faith, king of gods, and understand this:

source: །གང་རྣམ་པར་ཐར་པ་བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་ཏམ། ཀློག་གམ། ཀུན་ཆུབ་པར་བྱེད་པའི་རིགས་ཀྱི་བུ་ཕོའམ། རིགས་ཀྱི་བུ་མོ་བསོད་ནམས་ཤིན་ཏུ་མང་དུ་བསྐྱེད་དོ།
en: whoever accepts this exposition of the Dharma called Instruction in the Inconceivable Liberation, recites it, and understands it deeply, he or she will gather merits even greater than those who perform the above acts.

source: ལྷའི་དབང་པོ་འདི་ཇི་སྙམ་དུ་སེམས།
en: what do you think, king of gods?

source: རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་དེའི་གཞི་ལས་བསོད་ནམས་མང་དུ་བསྐྱེད་དམ།
en: Would that noble son or daughter receive much merit as a consequence of such activities?

source: བཅོམ་ལྡན་འདས་མང་ལགས་སོ། །བདེ་བར་གཤེགས་པ་མང་ལགས་ཏེ།
en: Many merits, Lord! Many merits, O Sugata!

source: བསྐལ་པ་བྱེ་བ་བརྒྱ་སྟོང་གིས་ཀྱང་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེའི་མཐར་ཕྱིན་པར་མི་ནུས་ལགས་སོ།
en: Were one to spend hundreds of thousands of millions of eons, it would be impossible to measure the limit of the mass of merits

source: ལྷའི་དབང་པོ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པའི་ཡང་ཆེས་གྲངས་མེད་པ། རྒྱ་ཆེ་བ། ཚད་མེད་པ། བསམ་གྱིས་མི་ཁྱབ་པར་གྱུར་པ་དེའི་དུས་དེའི་ཚེ་ན་
en: Once, king of gods, long ago, long before eons more numerous than the innumerable, immense, immeasurable, inconceivable, and even before then,

source: བསྐལ་པ་རྣམ་པར་སྦྱོང་བ་ལ་འཇིག་རྟེན་གྱི་ཁམས་ཆེར་བཀོད་པར་
en: in the eon called Vicaraṇa in the universe called Mahāvyūha.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྨན་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: the Tathāgata called Bhaiṣajyarāja appeared in the world: an arhat, perfectly and fully enlightened, endowed with knowledge and conduct, a blissful one, knower of the world, incomparable knower of men who need to be civilized, teacher of gods and men, a lord, a buddha.

source: །རྒྱལ་པོ་རིན་ཆེན་གདུགས་དེས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་རྒྱལ་པོ་འཁོར་དང་བཅས་པ་ལ་བར་གྱི་བསྐལ་པ་ལྔའི་བར་དུ་བདེ་བའི་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་རི་མོར་བྱས་སོ།
en: This King Ratnacchattra honored the Tathāgata Bhaiṣajyarāja and his retinue with many excellent offerings during five short eons.

source: རྒྱལ་པོ་རིན་ཆེན་གདུགས་ཀྱིས་བུ་སྟོང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: King Ratnacchattra said to his sons,

source: །ཀྱེ་ཁྱེད་ཤེས་པར་གྱིས་ཤིག །ངས་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་བྱས་ཀྱིས་ད་ཁྱེད་ཀྱིས་ཀྱང་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པར་གྱིས་ཤིག
en: ‘Recognizing that during my reign I have worshiped the Tathāgata, in your turn you also should worship him.

source: །དེ་ནས་རྒྱལ་བུ་གཞོན་ནུ་དེ་དག་ཕ་རྒྱལ་པོ་རིན་ཆེན་གདུགས་ལ་ལེགས་སོ་ཞེས་སྨྲས་ནས་དེ་མཉན་ཏེ།
en: The thousand princes gave their consent, obeying their father the king, and

source: དེ་དང་ལྷན་ཅིག་ཚོགས་ནས་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་རྒྱལ་པོ་ལ་བསྐལ་པ་བར་མ་ལྔའི་བར་དུ་བདེ་བའི་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་རིམ་གྲོར་བྱས་སོ།
en: all together, during another five short eons, they honored the Tathāgata Bhaiṣajyarāja with all sorts of excellent offerings.

source: །དེའི་ནང་ནས་རྒྱལ་བུ་ཟླ་གདུགས་ཞེས་བྱ་བ་དེ་གཅིག་པུ་དབེན་པར་སོང་ནས་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Among them, there was a prince by the name of Candracchattra, who retired into solitude and thought to himself,

source: མཆོད་པ་དེ་བས་མཆོད་པ་གཞན་ཆེས་ཁྱད་པར་དུ་འཕགས་ཤིང་རྒྱ་ཆེ་བ་ཡོད་དམ་སྙམ་པ་དང་།
en: Is there not another mode of worship, even better and more noble than this?

source: སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་བར་སྣང་དེ་ལས་ལྷ་དག་འདི་སྐད་ཅེས་ཟེར་རོ།
en: Then, by the supernatural power of the Buddha Bhaiṣajyarāja, the gods spoke to him from the heavens:

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་རྒྱལ་པོ་དེའི་དྲུང་དུ་སོང་ལ་ཆོས་ཀྱི་མཆོད་པ་དེ་གང་ལགས་ཞེས་ཞུས་ཤིག་དང་།
en: Good man, go to the Tathāgata Bhaiṣajyarāja, ask him about “Dharma-worship,” and

source: །བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་མཆོད་པ་ཆོས་ཀྱི་མཆོད་པ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་མཆོད་པ་དེ་གང་ལགས།
en: Lord, I have heard of a “Dharma-worship,” which surpasses all other worship. What is this “Dharma-worship”?

source: ཕྲ་བ་ཞིབ་པ། མི་དམིགས་པ།
en: They are subtle, precise, and ultimately incomprehensible.

source: ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལོ་སྟོན་པ། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལས་བྱུང་བ།
en: hey reveal the irreversible wheel of Dharma, arising from the six transcendences,

source: བདག་མེད་པ། སེམས་ཅན་མེད་པ། སྲོག་མེད་པ། གང་ཟག་མེད་པ། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་མི་བྱེད་པ་དང་། མ་སྐྱེས་པ་དང་། མ་བྱུང་བ་དང་ལྡན་པ།
en: They contain the message of selflessness, living-beinglessness, lifelessness, personlessness, voidness, signlessness, wishlessness, nonperformance, nonproduction, and nonoccurrence.

source: དམ་པའི་ཆོས་ཀྱི་རིགས་རྒྱུན་མི་གཅོད་པ། ཆོས་ཀྱི་མཛོད་འཛིན་པ། ཆོས་ཀྱི་མཆོད་པའི་མཆོག་ལ་ཞུགས་པ།
en: They preserve unbroken the heritage of the holy Dharma, contain the treasury of the Dharma, and represent the summit of Dharma-worship.

source: འཕགས་པའི་སྐྱེ་བོ་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་བཟུང་བ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་ཡང་དག་པར་སྟོན་པ།
en: They are upheld by all holy beings and teach all the bodhisattva practices.

source: ཆོས་ཀྱི་མདོ་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་དང་། ཞི་བ་ལས་ངེས་པར་བྱུང་བ།
en: They bring emancipation through teaching the epitomes of the Dharma, and the impermanence, misery, selflessness, and peace of all things.

source: འཁོར་བའི་ཕྱོགས་ཀྱི་གཉེན་པོ།
en: They are the medicines for the tendencies of mundane life,

source: མྱ་ངན་ལས་འདས་པའི་བདེ་བ་ཡང་དག་པར་སྟོན་པ་དེ་ལྟ་བུའི་མདོ་སྡེ་རྣམས་གང་ཡང་དག་པར་སྟོན་པ་དང་། འཆང་བ་དང་། སོ་སོར་རྟོག་པ་དང་།
en: and they authentically manifest the great happiness of liberation. To teach correctly, to uphold, to investigate, and to understand such sūtras,

source: ཆོས་ལ་ཆོས་བཞིན་ནན་ཏན་བྱེད་པ་དང་།
en: applying the Dharma according to the Dharma;

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བར་འཐུན་པ།
en: in harmony with relativity;

source: མཐར་ལྟ་བ་ཐམས་ཅད་དང་བྲལ་བ།
en: being free of extremist convictions;
